{
  "architectures": [
    "ChessModelHF"
  ],
  "d_embed": 768,
  "dropout": 0,
  "feed_forward_dim": 2048,
  "max_sequence_length": 512,
  "model_type": "chess_model",
  "n_head": 8,
  "num_layers": 3,
  "torch_dtype": "float32",
  "transformers_version": "4.45.0",
  "vocab_size": 370
}
